name: "NU-InNet-1.0"

layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_file: "jobs/20160723-203243-82a9/mean.binaryproto"
  }
  data_param {
    source: "jobs/20160723-203243-82a9/train_db"
    batch_size: 128
    backend: LMDB
  }
}

layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_file: "jobs/20160723-203243-82a9/mean.binaryproto"
  }
  data_param {
    source: "jobs/20160723-203243-82a9/val_db"
    batch_size: 128
    backend: LMDB
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 3
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv1_bn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv1_scale"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2_reduce"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_reduce"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_reduce_bn"
  type: "BatchNorm"
  bottom: "conv2_reduce"
  top: "conv2_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_reduce_scale"
  type: "Scale"
  bottom: "conv2_reduce"
  top: "conv2_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_reduce_relu"
  type: "ReLU"
  bottom: "conv2_reduce"
  top: "conv2_reduce"
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv2_reduce"
  top: "conv2"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv2_bn"
  type: "BatchNorm"
  bottom: "conv2"
  top: "conv2"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_scale"
  type: "Scale"
  bottom: "conv2"
  top: "conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_relu"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "nu_inception_reduce"
  type: "Convolution"
  bottom: "pool2"
  top: "nu_inception_reduce"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "nu_inception_reduce_bn"
  type: "BatchNorm"
  bottom: "nu_inception_reduce"
  top: "nu_inception_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_inception_reduce_scale"
  type: "Scale"
  bottom: "nu_inception_reduce"
  top: "nu_inception_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_inception_reduce_relu"
  type: "ReLU"
  bottom: "nu_inception_reduce"
  top: "nu_inception_reduce"
}
layer {
  name: "nu_inception_1x1"
  type: "Convolution"
  bottom: "nu_inception_reduce"
  top: "nu_inception_1x1"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "nu_inception_1x1_bn"
  type: "BatchNorm"
  bottom: "nu_inception_1x1"
  top: "nu_inception_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_inception_1x1_scale"
  type: "Scale"
  bottom: "nu_inception_1x1"
  top: "nu_inception_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_inception_relu_1x1"
  type: "ReLU"
  bottom: "nu_inception_1x1"
  top: "nu_inception_1x1"
}
layer {
  name: "nu_inception_3x3"
  type: "Convolution"
  bottom: "nu_inception_reduce"
  top: "nu_inception_3x3"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "nu_inception_3x3_bn"
  type: "BatchNorm"
  bottom: "nu_inception_3x3"
  top: "nu_inception_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_inception_3x3_scale"
  type: "Scale"
  bottom: "nu_inception_3x3"
  top: "nu_inception_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_inception_relu_3x3"
  type: "ReLU"
  bottom: "nu_inception_3x3"
  top: "nu_inception_3x3"
}
layer {
  name: "nu_inception_5x5"
  type: "Convolution"
  bottom: "nu_inception_reduce"
  top: "nu_inception_5x5"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "nu_inception_5x5_bn"
  type: "BatchNorm"
  bottom: "nu_inception_5x5"
  top: "nu_inception_5x5"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_inception_5x5_scale"
  type: "Scale"
  bottom: "nu_inception_5x5"
  top: "nu_inception_5x5"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_inception_relu_5x5"
  type: "ReLU"
  bottom: "nu_inception_5x5"
  top: "nu_inception_5x5"
}
layer {
  name: "nu_inception_7x7"
  type: "Convolution"
  bottom: "nu_inception_reduce"
  top: "nu_inception_7x7"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 3
    kernel_size: 7
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "nu_inception_7x7_bn"
  type: "BatchNorm"
  bottom: "nu_inception_7x7"
  top: "nu_inception_7x7"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_inception_7x7_scale"
  type: "Scale"
  bottom: "nu_inception_7x7"
  top: "nu_inception_7x7"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_inception_relu_7x7"
  type: "ReLU"
  bottom: "nu_inception_7x7"
  top: "nu_inception_7x7"
}
layer {
  name: "nu_inception_output"
  type: "Concat"
  bottom: "nu_inception_1x1"
  bottom: "nu_inception_3x3"
  bottom: "nu_inception_5x5"
  bottom: "nu_inception_7x7"
  top: "nu_inception_output"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "nu_inception_output"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "nu_1_inception_reduce"
  type: "Convolution"
  bottom: "pool3"
  top: "nu_1_inception_reduce"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "nu_1_inception_reduce_bn"
  type: "BatchNorm"
  bottom: "nu_1_inception_reduce"
  top: "nu_1_inception_reduce"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_1_inception_reduce_scale"
  type: "Scale"
  bottom: "nu_1_inception_reduce"
  top: "nu_1_inception_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_1_inception_reduce_relu"
  type: "ReLU"
  bottom: "nu_1_inception_reduce"
  top: "nu_1_inception_reduce"
}
layer {
  name: "nu_1_inception_1x1"
  type: "Convolution"
  bottom: "nu_1_inception_reduce"
  top: "nu_1_inception_1x1"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "nu_1_inception_1x1_bn"
  type: "BatchNorm"
  bottom: "nu_1_inception_1x1"
  top: "nu_1_inception_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_1_inception_1x1_scale"
  type: "Scale"
  bottom: "nu_1_inception_1x1"
  top: "nu_1_inception_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_1_inception_relu_1x1"
  type: "ReLU"
  bottom: "nu_1_inception_1x1"
  top: "nu_1_inception_1x1"
}
layer {
  name: "nu_1_inception_3x3"
  type: "Convolution"
  bottom: "nu_1_inception_reduce"
  top: "nu_1_inception_3x3"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "nu_1_inception_3x3_bn"
  type: "BatchNorm"
  bottom: "nu_1_inception_3x3"
  top: "nu_1_inception_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_1_inception_3x3_scale"
  type: "Scale"
  bottom: "nu_1_inception_3x3"
  top: "nu_1_inception_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_1_inception_relu_3x3"
  type: "ReLU"
  bottom: "nu_1_inception_3x3"
  top: "nu_1_inception_3x3"
}
layer {
  name: "nu_1_inception_5x5"
  type: "Convolution"
  bottom: "nu_1_inception_reduce"
  top: "nu_1_inception_5x5"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "nu_1_inception_5x5_bn"
  type: "BatchNorm"
  bottom: "nu_1_inception_5x5"
  top: "nu_1_inception_5x5"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_1_inception_5x5_scale"
  type: "Scale"
  bottom: "nu_1_inception_5x5"
  top: "nu_1_inception_5x5"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_1_inception_relu_5x5"
  type: "ReLU"
  bottom: "nu_1_inception_5x5"
  top: "nu_1_inception_5x5"
}
layer {
  name: "nu_1_inception_7x7"
  type: "Convolution"
  bottom: "nu_1_inception_reduce"
  top: "nu_1_inception_7x7"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 3
    kernel_size: 7
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "nu_1_inception_7x7_bn"
  type: "BatchNorm"
  bottom: "nu_1_inception_7x7"
  top: "nu_1_inception_7x7"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "nu_1_inception_7x7_scale"
  type: "Scale"
  bottom: "nu_1_inception_7x7"
  top: "nu_1_inception_7x7"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "nu_1_inception_relu_7x7"
  type: "ReLU"
  bottom: "nu_1_inception_7x7"
  top: "nu_1_inception_7x7"
}
layer {
  name: "nu_1_inception_output"
  type: "Concat"
  bottom: "nu_1_inception_1x1"
  bottom: "nu_1_inception_3x3"
  bottom: "nu_1_inception_5x5"
  bottom: "nu_1_inception_7x7"
  top: "nu_1_inception_output"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "nu_1_inception_output"
  top: "pool4"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "pool4"
  top: "ip1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 50
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip1"
  bottom: "label"
  top: "loss"
}
